УНФ_ТЕСТ/src/InformationRegisters/НастройкиЗагрузкиПисем/НастройкиЗагрузкиПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗагрузкиПисем</name>
  <resources>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиПисем</types>
    </type>
  </resources>
  <resources>
    <name>ВариантСинхронизации</name>
    <type>
      <types>EnumRef.ВариантыСинхронизацииПисем</types>
    </type>
  </resources>
  <resources>
    <name>ВариантУдаления</name>
    <type>
      <types>EnumRef.ВариантыУдаленияПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПочтоваяПапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Enums/ВариантыЗагрузкиПисем/ВариантыЗагрузкиПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиПисем</name>
  <enumValues>
    <name>НеЗагружать</name>
  </enumValues>
  <enumValues>
    <name>ТолькоЗаголовки</name>
  </enumValues>
  <enumValues>
    <name>ТекстыИВложения</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВариантыСинхронизацииПисем/ВариантыСинхронизацииПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыСинхронизацииПисем</name>
  <enumValues>
    <name>НеСинхронизировать</name>
  </enumValues>
  <enumValues>
    <name>Просмотр</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрИУдаление</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/InformationRegisters/НастройкиЗагрузкиПисем/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана учетная запись для настройки почтовых ящиков.'");
	КонецЕсли;
	
	Если Не НастройкиСуществуют(УчетнаяЗапись) Тогда
		ЭлектроннаяПочтаУНФ.ОбновитьПочтовыеПапки(УчетнаяЗапись);
	КонецЕсли;
	
	ЗаполнитьТаблицуНастроек();
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиЗагрузкиПисем) Тогда
		Элементы.ФормаОбновитьПочтовыеПапки.Доступность = Ложь;
		Элементы.НастройкиЗагрузкиПисем.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПочтовыеЯщики

&НаКлиенте
Процедура НастройкиЗагрузкиПисемВариантЗагрузкиПриИзменении(Элемент)
	
	ЗаписатьНастройкуПочтовогоЯщика(
	УчетнаяЗапись,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ПочтоваяПапка,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантЗагрузки,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантСинхронизации);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗагрузкиПисемВариантЗагрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.ВариантыЗагрузкиПисем.НеЗагружать");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗагрузкиПисемВариантСинхронизацииПриИзменении(Элемент)
	
	ЗаписатьНастройкуПочтовогоЯщика(
	УчетнаяЗапись,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ПочтоваяПапка,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантЗагрузки,
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантСинхронизации);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗагрузкиПисемВариантСинхронизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.НастройкиЗагрузкиПисем.ТекущиеДанные.ВариантСинхронизации = ПредопределенноеЗначение("Перечисление.ВариантыСинхронизацииПисем.НеСинхронизировать");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПочтовыеПапки(Команда)
	
	ОбновитьПочтовыеЯщикиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НастройкиСуществуют(Знач УчетнаяЗапись)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиЗагрузкиПисем.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.НастройкиЗагрузкиПисем КАК НастройкиЗагрузкиПисем
	|ГДЕ
	|	НастройкиЗагрузкиПисем.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроек()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиЗагрузкиПисем.ПочтоваяПапка КАК ПочтоваяПапка,
	|	НастройкиЗагрузкиПисем.ВариантЗагрузки КАК ВариантЗагрузки,
	|	НастройкиЗагрузкиПисем.ВариантСинхронизации КАК ВариантСинхронизации
	|ИЗ
	|	РегистрСведений.НастройкиЗагрузкиПисем КАК НастройкиЗагрузкиПисем
	|ГДЕ
	|	НастройкиЗагрузкиПисем.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		НастройкиЗагрузкиПисем.Загрузить(РезультатЗапроса.Выгрузить());
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПочтовыеЯщикиНаСервере()
	
	ЭлектроннаяПочтаУНФ.ОбновитьПочтовыеПапки(УчетнаяЗапись);
	ЗаполнитьТаблицуНастроек();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНастройкуПочтовогоЯщика(
	Знач УчетнаяЗапись,
	Знач ПочтоваяПапка,
	Знач ВариантЗагрузки,
	Знач ВариантСинхронизации)
	
	МенеджерЗаписи = РегистрыСведений.НастройкиЗагрузкиПисем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	МенеджерЗаписи.ПочтоваяПапка = ПочтоваяПапка;
	МенеджерЗаписи.ВариантЗагрузки = ВариантЗагрузки;
	МенеджерЗаписи.ВариантСинхронизации = ВариантСинхронизации;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
